---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarBarType
source: html/206e9dc6-5fc1-c0a8-6c76-d5a53ee93a39.htm
---
# RebarBarType Properties

The id of the assembly instance to which the element belongs.